app/views/searches/new.html.erb

      <%= f.label :category_id %><br />
      <%= f.collection_select :category_id, Category.order(:name), :id, :name, include_blank: true  %>
---
SELECT "categories".* FROM "categories" ORDER BY name