app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY name
---
  def index
    @products = Product.search(params[:search])

SELECT distinct name FROM "products" WHERE (name like '%A%') ORDER BY name
SELECT "products".* FROM "products" WHERE (name like '%%') ORDER BY name
---
  def list
    @products = Product.select("distinct name").order(:name).where("name like ?", "%#{params[:term]}%")
    render :json => @products.map(&:name)