app/controllers/searches_controller.rb

  def show
    @search = Search.find(params[:id])
---
SELECT "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT 1  [["id", "8"]]

  def create
    @search = Search.create!(params[:search])
---
INSERT INTO "searches" ("category_id", "created_at", "keywords", "max_price", "min_price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)